src/InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПринятПоДолгосрочномуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринятПоДолгосрочномуДоговоруПоОкончании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииИзменений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
			
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ЗаписьНабора.ДействуетДо) Тогда
			ЗаписьНабора.ДействуетДо = КонецМесяца(ЗаписьНабора.ДействуетДо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьНабора.ДействуетДо) Тогда
			ЗаписьНабора.ПринятПоДолгосрочномуДоговоруПоОкончании = Не ЗаписьНабора.ПринятПоДолгосрочномуДоговору;
		Иначе
			ЗаписьНабора.ПринятПоДолгосрочномуДоговоруПоОкончании = Ложь;
		КонецЕсли;			
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
